{
    "bake": "To cook food in an oven using dry heat, typically for breads, cakes, pastries, and casseroles.",
    "roast": "To cook food in an oven or over fire using dry heat, usually applied to larger cuts of meat and vegetables to develop a browned exterior.",
    "grill": "To cook food over direct heat, typically on metal grates above a flame or hot coals, creating char marks and smoky flavor.",
    "broil": "To cook food using direct heat from above, typically in an oven, creating a browned or caramelized top surface.",
    "fry": "To cook food in hot oil or fat, creating a crispy exterior.",
    "deep fry": "To completely submerge food in hot oil, cooking it quickly and creating a crispy coating all around.",
    "deep_fry": "To completely submerge food in hot oil, cooking it quickly and creating a crispy coating all around.",
    "pan fry": "To cook food in a shallow layer of oil or fat in a pan, usually enough to come halfway up the food.",
    "pan_fry": "To cook food in a shallow layer of oil or fat in a pan, usually enough to come halfway up the food.",
    "shallow fry": "To cook food in a small amount of oil in a pan, similar to pan frying but with less oil than deep frying.",
    "shallow_fry": "To cook food in a small amount of oil in a pan, similar to pan frying but with less oil than deep frying.",
    "air fry": "To cook food using circulating hot air to create a crispy exterior similar to deep frying but with little to no oil.",
    "air_fry": "To cook food using circulating hot air to create a crispy exterior similar to deep frying but with little to no oil.",
    "saute": "To cook food quickly in a small amount of fat over relatively high heat while stirring or tossing frequently.",
    "sauté": "To cook food quickly in a small amount of fat over relatively high heat while stirring or tossing frequently.",
    "sear": "To cook the surface of food at high temperature until a brown crust forms, locking in juices and creating flavor.",
    "brown": "To cook food until the surface turns brown, developing flavor through caramelization and the Maillard reaction.",
    "char": "To cook food until the surface is darkened or blackened, creating a slightly bitter, smoky flavor.",
    "toast": "To brown bread or other foods by exposure to dry heat, making them crisp and golden.",
    "boil": "To cook food in water or liquid heated to 212°F (100°C), with rapid bubbles breaking the surface.",
    "simmer": "To cook food in liquid kept just below boiling point, with small bubbles occasionally rising to the surface.",
    "steam": "To cook food using hot vapor from boiling water, preserving nutrients and natural flavors without submerging in liquid.",
    "poach": "To cook food gently in liquid kept just below simmering temperature, typically used for delicate items like eggs and fish.",
    "parboil": "To partially cook food by boiling briefly, usually as a preparatory step before finishing with another cooking method.",
    "blanch": "To briefly immerse food in boiling water then immediately transfer to ice water to stop cooking, often to preserve color and texture.",
    "scald": "To heat liquid, usually milk, to just below boiling point, or to briefly immerse food in boiling water.",
    "pressure cook": "To cook food in a sealed pot where steam builds pressure, raising the boiling point and cooking food faster.",
    "pressure_cook": "To cook food in a sealed pot where steam builds pressure, raising the boiling point and cooking food faster.",
    "slow cook": "To cook food at low temperature over an extended period, typically several hours, to develop flavors and tenderize tough cuts.",
    "slow_cook": "To cook food at low temperature over an extended period, typically several hours, to develop flavors and tenderize tough cuts.",
    "sous vide": "To cook food sealed in a bag in a temperature-controlled water bath for precise, even cooking.",
    "sous_vide": "To cook food sealed in a bag in a temperature-controlled water bath for precise, even cooking.",
    "braise": "To cook food by first searing at high heat, then simmering slowly in a covered pot with a small amount of liquid.",
    "stew": "To cook food slowly in liquid, completely submerged, until tender and infused with the cooking liquid's flavors.",
    "confí": "To cook food slowly in fat at low temperature until very tender, traditionally used for duck and other meats.",
    "confit": "To cook food slowly in fat at low temperature until very tender, traditionally used for duck and other meats.",
    "smother": "To cook food covered with a sauce or other ingredients, usually in a covered pot, until very tender.",
    "smoke": "To expose food to smoke from burning wood or other materials, adding flavor and sometimes preserving it.",
    "cure": "To preserve food using salt, sugar, or other agents, sometimes with smoking, to extend shelf life and add flavor.",
    "pickle": "To preserve food in an acidic solution, typically vinegar or brine, creating tangy flavor and extending shelf life.",
    "ferment": "To preserve and transform food using beneficial bacteria or yeasts, creating complex flavors and improving digestibility.",
    "dehydrate": "To remove moisture from food to preserve it and concentrate flavors, using low heat, air circulation, or sun drying.",
    "microwave": "To cook or heat food using electromagnetic waves that cause water molecules to vibrate and generate heat.",
    "warm": "To gently heat food to a comfortable eating temperature without fully cooking it.",
    "heat": "To raise the temperature of food, either for cooking or to make it warmer for serving.",
    "reheat": "To warm previously cooked food back to serving temperature.",
    "chop": "To cut food into pieces, typically of irregular size, using a knife in a downward motion.",
    "dice": "To cut food into small, uniform cubes, typically between 1/4 to 3/4 inch.",
    "mince": "To cut food into very fine pieces, smaller than diced, often used for garlic, herbs, and aromatics.",
    "slice": "To cut food into thin, flat pieces using a smooth cutting motion.",
    "julienne": "To cut food into thin, matchstick-like strips, typically about 1/8 inch thick and 2 inches long.",
    "cube": "To cut food into uniform square pieces, typically larger than diced, around 3/4 to 1 inch per side.",
    "crush": "To break down food into smaller pieces or paste-like consistency using pressure, such as with a garlic press or mortar.",
    "grate": "To reduce food to small shreds by rubbing it against a rough surface with sharp-edged holes.",
    "shred": "To cut or tear food into thin strips or small pieces, often using a grater or by pulling apart cooked meat.",
    "zest": "To remove the colored outer peel of citrus fruit using a grater or zester, avoiding the bitter white pith.",
    "peel": "To remove the outer skin or rind from fruits and vegetables.",
    "trim": "To cut away unwanted parts such as fat, skin, stems, or damaged portions from food.",
    "core": "To remove the central, often inedible part of fruits and vegetables, such as apple cores.",
    "seed": "To remove seeds from fruits, vegetables, or peppers.",
    "pit": "To remove the hard stone or seed from fruits like cherries, peaches, or avocados.",
    "debone": "To remove bones from meat, poultry, or fish.",
    "fillet": "To cut meat or fish away from the bone or to slice it into thin, flat pieces.",
    "butterfly": "To cut food almost in half horizontally, then open it like a book to create a thinner, larger piece.",
    "halve": "To cut something into two equal pieces.",
    "mix": "To combine ingredients together until they are evenly distributed.",
    "stir": "To move ingredients around in a container using a circular motion to combine or prevent sticking.",
    "whisk": "To beat ingredients rapidly using a whisk to incorporate air and create a smooth, light texture.",
    "beat": "To mix ingredients vigorously to combine them and incorporate air, typically using a whisk or electric mixer.",
    "fold": "To gently combine ingredients using a careful lifting and turning motion to preserve air and lightness.",
    "blend": "To mix ingredients together until they form a smooth, uniform mixture.",
    "puree": "To blend or process food until it reaches a smooth, creamy consistency with no lumps.",
    "emulsify": "To combine two liquids that normally don't mix, such as oil and vinegar, into a stable mixture.",
    "combine": "To mix ingredients together until they are evenly distributed throughout.",
    "toss": "To mix ingredients by repeatedly lifting and turning them, often used for salads.",
    "knead": "To work dough by pressing, folding, and stretching it to develop gluten and create the desired texture.",
    "cream": "To beat fat (usually butter) and sugar together until light, fluffy, and pale in color.",
    "whip": "To beat ingredients, usually cream or egg whites, vigorously to incorporate air and increase volume.",
    "marinate": "To soak food in a seasoned liquid to add flavor and sometimes tenderize it before cooking.",
    "brine": "To soak food, usually meat, in a salt water solution to add moisture, flavor, and improve texture.",
    "soak": "To immerse food in liquid for an extended period to soften, rehydrate, or remove unwanted substances.",
    "season": "To add salt, pepper, herbs, spices, or other flavorings to food to enhance its taste.",
    "coat": "To cover food with a layer of another ingredient, such as flour, breadcrumbs, or sauce.",
    "batter": "To coat food with a liquid mixture of flour, eggs, and liquid before cooking, typically for frying.",
    "bread": "To coat food with breadcrumbs, often after dipping in egg or flour, to create a crispy coating when cooked.",
    "dredge": "To lightly coat food with a dry ingredient like flour or breadcrumbs before cooking.",
    "strain": "To separate liquids from solids by passing through a sieve, colander, or cheesecloth.",
    "drain": "To remove liquid from food, typically by placing in a colander or strainer.",
    "rinse": "To wash food with water to remove dirt, debris, or excess starch, salt, or other substances.",
    "wash": "To clean food with water to remove dirt, bacteria, or residues before preparation or consumption.",
    "cool": "To lower the temperature of food, often by leaving at room temperature or placing in a cooler environment.",
    "chill": "To refrigerate food to make it cold before serving or to firm it up.",
    "freeze": "To lower food's temperature below 32°F (0°C) to solidify it and preserve it for extended periods.",
    "thaw": "To bring frozen food back to a liquid or soft state by allowing it to warm up.",
    "defrost": "To remove frost or ice from frozen food by allowing it to reach a temperature above freezing.",
    "rest": "To let cooked meat sit for a period before cutting, allowing juices to redistribute throughout for better moisture and flavor.",
    "proof": "To let yeast dough rise in a warm environment, allowing the yeast to ferment and create gas that makes dough expand.",
    "rise": "To allow dough to increase in volume as yeast ferments and produces gas, typically in a warm location.",
    "reduce": "To simmer or boil liquid to evaporate water and concentrate flavors, thickening the sauce or liquid.",
    "thicken": "To increase the viscosity of a liquid by adding thickening agents or reducing through evaporation.",
    "deglaze": "To add liquid to a hot pan to loosen browned bits of food stuck to the bottom, creating a flavorful sauce base.",
    "glaze": "To coat food with a glossy liquid that adds flavor and shine, or to apply a shiny finish by reducing liquid.",
    "baste": "To brush or spoon liquid over food during cooking to add moisture, flavor, and promote browning.",
    "garnish": "To decorate a finished dish with small amounts of food or herbs to enhance visual appeal and add complementary flavors."
}
